# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний
# и т.д. Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

a = list(map(int, input(
    'Введите числа строки через пробел: ').split()))

b = []

if len(a) % 2 == 0:
    c = len(a)//2
else:
    c = len(a)//2 + 1

for i in range(c):
    b.append(a[i]*a[len(a)-1-i])

print(f"{a} -> {b}")
